{
  "worlds": [
    {
      "id": "gionkir",
      "name": "기온키르",
      "img": "worlds/gionkir.png",
      "intro": "검과 성벽의 땅 — 장대한 요새와 어둠 속 통로가 공존한다.",
      "detail": {
        "lore": "기온키르는 오래된 성벽 아래로 뻗은 복잡한 터널과 칼의 예식을 숭배하는 요새들로 유명하다. 낮이면 훈련과 의전의 소리가 들리고, 밤이면 성벽 아래 어둠에서 비밀스러운 이동이 감지된다.",
        "sites": [
          {
            "id": "wall-tunnel",
            "name": "성벽 아래 통로",
            "img": "sites/gionkir/wall-tunnel.png",
            "description": "낮은 물소리와 비밀을 머금은 어두운 통로.",
            "type": "dungeon",
            "tags": ["어둠","비밀"],
            "difficulty": "hard"
          },
          {
            "id": "fortress",
            "name": "검의 요새",
            "img": "sites/gionkir/fortress.png",
            "description": "의전과 수련의 회랑, 검술의 전당.",
            "type": "stronghold",
            "tags": ["의전","훈련"],
            "difficulty": "easy"
            
          }
        ],
        "lore_long": "새벽의 안개가 성벽 위로 깔리면, 기온키르의 하루는 검 부딪는 소리와 함께 시작된다. 이곳의 사람들은 강철을 신뢰하고, 검의 길을 삶의 유일한 지표로 삼는다. 거대한 검의 요새에서는 대대로 전해져 내려오는 고대의 검술 의식이 치러지며, 젊은 전사들은 자신의 명예와 가문의 영광을 위해 훈련에 매진한다. 그러나 해가 지고 육중한 성문이 닫히면, 기온키르의 또 다른 얼굴이 드러난다. 성벽 아래, 미로처럼 얽힌 통로는 축축한 어둠과 비밀을 품고 꿈틀거린다. 이 지하 통로는 단순한 이동 경로가 아니라, 밀수꾼들의 거래 장소이자, 금지된 지식을 탐하는 자들의 은신처이며, 때로는 왕좌를 노리는 음모가 시작되는 곳이기도 하다. 낮의 영광스러운 함성은 밤의 은밀한 속삭임에 자리를 내주고, 성벽 위를 지키는 파수꾼의 횃불만이 이 두 세계의 경계를 위태롭게 비출 뿐이다. 사람들은 \"기온키르에서는 벽에도 귀가 있고, 그림자에도 칼날이 숨어 있다\"고 말한다. 진정한 힘은 빛나는 검술 실력뿐만 아니라, 어둠 속에서 길을 잃지 않는 지혜에서 나온다는 것을 모두가 알고 있기 때문이다."
      }
    },
    {
      "id": "ahnoria",
      "name": "아노리아",
      "img": "worlds/ahnoria.png",
      "intro": "바람과 바다의 나라 — 등대와 항로가 생존의 열쇠이다.",
      "detail": {
        "lore": "아노리아의 해안선에는 오래된 등대와 암초가 많아 항로가 위험하지만, 그만큼 해적과 보물이 숨어 있다. 주민들은 바다의 신을 숭배하며 항해 기술을 전수한다.",
        "sites": [
          {
            "id": "lighthouse",
            "name": "등대의 집",
            "img": "sites/ahnoria/lighthouse.png",
            "description": "바다를 바라보는 외딴 등대, 오래된 전설이 깃들었다.",
            "type": "landmark",
            "tags": ["바다","전설"],
            "difficulty": "normal"
          }
        ],
        "lore_long": "아노리아의 공기는 언제나 소금기와 축축한 바람의 냄새로 가득하다. 이곳의 역사는 파도에 의해 쓰이고, 사람들의 운명은 조수에 따라 결정된다. 해안선을 따라 점점이 박힌 낡은 등대들은 단순한 불빛이 아니라, 폭풍우 치는 밤바다를 헤쳐나간 선조들의 영혼이 깃든 성소다. 등대지기들은 단순한 감시자가 아니라, 바다의 변덕스러운 분노를 달래는 사제이자, 고대부터 내려오는 바다의 전설을 다음 세대로 전하는 이야기꾼이다. 그들은 안개 너머에서 들려오는 유령선의 노랫소리를 구분하고, 암초에 부딪혀 사라진 보물선의 위치를 별자리를 통해 읽어낸다고 한다. 아노리아의 아이들은 뭍에서 걷는 법보다 돛을 다루는 법을 먼저 배우며, 그들의 기도는 언제나 바다의 신, '깊은 곳의 잠든 이'에게 향한다. 항해 기술은 곧 생존이며, 모든 선박의 뱃머리에는 신의 가호를 비는 조각상이 달려 있다. 하지만 이 위험한 바다는 기회와 부를 약속하기도 한다. 대담한 선원들은 해적의 위협과 흉포한 바다 괴물의 전설을 무릅쓰고 미지의 항로를 개척하며, 그들이 가져오는 이국의 보물과 신비로운 이야기는 항구 도시의 선술집을 떠들썩하게 만든다. 아노리아에서 바다는 삶의 터전이자 무덤이며, 희망이자 절망이다."
      }
    },
    {
      "id": "elysium",
      "name": "엘리시움",
      "img": "worlds/elysium.png",
      "intro": "빛과 기계가 공존하는 도시국가.",
      "detail": {
        "lore": "엘리시움은 빛의 기술과 고대의 마법이 융합된 도시국가로, 공중 정원과 기계의 심장이 도시를 지탱한다. 지식과 힘을 둘러싼 갈등이 끊이지 않는다.",
        "sites": [
          {
            "id": "skygarden",
            "name": "공중 정원",
            "img": "sites/elysium/skygarden.png",
            "description": "공중에 펼쳐진 정원, 기계와 식물이 공존한다.",
            "type": "garden",
            "tags": ["기술","평화"],
            "difficulty": "easy"
          }
        ],
        "lore_long": "엘리시움의 하늘은 언제나 수정과 금속으로 만들어진 탑들 사이로 부드러운 인공의 빛이 흐른다. 이곳은 고대의 마법 원리와 최첨단 기계 공학이 기묘한 조화를 이루는 곳으로, 도시의 동력원인 '기계 심장'은 마나를 흡수하여 빛 에너지로 변환하며 거대한 도시 전체를 공중에 띄우고 있다. 시민들은 빛을 다루는 기술자 '루미나'와 고대 지식을 연구하는 마법사 '아르카니스트' 두 계급으로 나뉘어 살아간다. 루미나들은 빛으로 홀로그램을 만들고 에너지 장벽을 치며 도시의 기반 시설을 유지하고, 아르카니스트들은 잊혀진 주문과 유물을 통해 자연의 법칙을 왜곡하려 한다. 그들의 협력으로 탄생한 공중 정원은 금속 덩굴과 마법으로 피어나는 수정 꽃이 어우러진 경이로운 장소이지만, 이 아름다운 풍경 뒤에는 지식과 힘의 주도권을 둘러싼 치열한 암투가 존재한다. 기계 심장의 통제권을 누가 갖느냐에 따라 엘리시움의 미래가 결정되기 때문이다. 기술의 진보를 외치는 자들과 마법의 순수성을 지켜야 한다고 믿는 자들 사이의 보이지 않는 전쟁은 도시의 가장 높은 첨탑에서부터 가장 낮은 동력실에 이르기까지, 엘리시움의 모든 곳에 스며들어 있다. 이 고요한 갈등 속에서, 어떤 이들은 두 힘의 완전한 융합만이 엘리시움이 다음 단계로 나아갈 유일한 길이라고 믿으며 비밀리에 새로운 길을 모색하고 있다."
      }
    },
    {
      "id": "bellagron",
      "name": "벨라그론",
      "img": "worlds/bellagron.png",
      "intro": "우주의 심연을 탐구하는 거대 연구 도시.",
      "detail": {
        "lore": "벨라그론은 인류의 우주 연구를 위해 건설된 초거대 도시. 행성 간 이동이 1분 안에 가능한 압도적인 기술력을 자랑한다. 하지만 우주의 진실을 깨달은 연구원들이 '감당할 수 없어'라는 말을 남기고 스스로 목숨을 끊는 기이한 사건들이 발생한다.",
        "sites": [
          {
            "id": "ricore",
            "name": "부화 행성 '리코르'",
            "img": "sites/bellagron/ricore.png",
            "description": "150년 전 게이트 붕괴로 고립된 행성. 'numder4356'에 의해 행성 자체가 살아있는 생명체로 변이되었으며, 보이는 모든 것을 집어삼킨다. 살아있는 지옥이 된 곳.",
            "type": "dungeon",
            "tags": ["생존","공포","변이"],
            "difficulty": "hard"
          },
          {
            "id": "info-tomb",
            "name": "정보의 무덤",
            "img": "sites/bellagron/info-tomb.png",
            "description": "리코르 행성 중심부에 위치한 'numder4356'의 변이가 가장 격렬하게 일어나는 장소. 현실과 비현실의 경계가 무너져 시공간이 뒤틀려 있다.",
            "type": "dungeon",
            "tags": ["미스터리","카오스","정신적 위협"],
            "difficulty": "very_hard"
          },
          {
            "id": "observers-eye",
            "name": "관측자의 눈",
            "img": "sites/bellagron/observers-eye.png",
            "description": "도시의 가장 높은 첨탑에 위치한 거대한 구조물. 우주의 모든 지식이 담긴 '지식의 심연'을 관측하며 도시에 동력을 공급한다. 연구원들의 자살 사건이 이곳과 관련 있다.",
            "type": "landmark",
            "tags": ["기술","지식","미스터리"],
            "difficulty": "very_hard"
          }
        ],
        "lore_long": "벨라그론은 인류의 지적 호기심이 낳은 가장 위대한 걸작이자, 동시에 가장 끔찍한 오만입니다. 행성 간을 1분 만에 왕복하는 첨단 기술과 모든 것을 집어삼키는 저주 마법, 고대 문명의 유물까지, 그들은 우주 연구를 위해 수단과 방법을 가리지 않았습니다. 도시의 상공에 자리 잡은 **'관측자의 눈'**은 그들의 야망을 상징하는 거대한 구조물입니다. 이 시설은 단순히 우주를 관측하는 것을 넘어, 도시 전체에 동력을 공급하는 '우주의 심장' 역할을 합니다. 하지만 이 기술력의 이면에는 끔찍한 진실이 숨겨져 있습니다. 관측자의 눈이 응시하는 거대한 소용돌이(블랙홀)는 단순한 물리적 특이점이 아니라, 우주 만물의 모든 정보가 담긴 **'지식의 심연'**입니다. 연구원들은 이 심연을 들여다보며 우주의 탄생과 종말, 그리고 존재의 본질에 대한 해답을 얻고자 했지만, 그 과정에서 그 진실이 인간의 정신이 감당할 수 없을 만큼 거대하고 공포스럽다는 것을 깨달았습니다. 결국 “감당할 수 없어…”라는 마지막 말을 남긴 채 스스로 목숨을 끊은 연구원들의 이야기는 이제 벨라그론의 그림자가 되었습니다. 벨라그론의 지도자들은 이 실패를 은폐하고, 더 깊은 심연의 비밀을 파헤치기 위해 탐욕스럽게 연구를 계속하고 있습니다."
      }
    }
  ]
}
